ChibiOS/ChibiOS/os/hal/platforms/STM32F37x/adc_lld.h
#if STM32_ADC_USE_SDADC1 && !STM32_HAS_SDADC1
#error "SDADC1 not present in the selected device"
#endif

#if STM32_ADC_USE_SDADC2 && !STM32_HAS_SDADC2
#error "SDADC2 not present in the selected device"
#endif

#if STM32_ADC_USE_SDADC3 && !STM32_HAS_SDADC3
#error "SDADC3 not present in the selected device"
#endif

#if !STM32_ADC_USE_ADC1 && !STM32_ADC_USE_ADC2 && !STM32_ADC_USE_ADC3
#error "ADC driver activated but no ADC peripheral assigned"
#endif

#if STM32_ADC_USE_ADC1 &&                                                   \
    !STM32_DMA_IS_VALID_ID(STM32_ADC_ADC1_DMA_STREAM, STM32_ADC1_DMA_MSK)
#error "invalid DMA stream associated to ADC1"
#endif

#if STM32_ADC_USE_ADC2 &&                                                   \
    !STM32_DMA_IS_VALID_ID(STM32_ADC_ADC2_DMA_STREAM, STM32_ADC2_DMA_MSK)
#error "invalid DMA stream associated to ADC2"
#endif

#if STM32_ADC_USE_ADC3 &&                                                   \
    !STM32_DMA_IS_VALID_ID(STM32_ADC_ADC3_DMA_STREAM, STM32_ADC3_DMA_MSK)
#error "invalid DMA stream associated to ADC3"
#endif

#if STM32_ADC_USE_SDADC1 &&                                                   \
    !STM32_DMA_IS_VALID_ID(STM32_ADC_SDADC1_DMA_STREAM, STM32_SDADC1_DMA_MSK)
#error "invalid DMA stream associated to SDADC1"
#endif

#if STM32_ADC_USE_SDADC2 &&                                                   \
    !STM32_DMA_IS_VALID_ID(STM32_ADC_SDADC2_DMA_STREAM, STM32_SDADC2_DMA_MSK)
#error "invalid DMA stream associated to SDADC2"
#endif

#if STM32_ADC_USE_SDADC3 &&                                                   \
    !STM32_DMA_IS_VALID_ID(STM32_ADC_SDADC3_DMA_STREAM, STM32_SDADC3_DMA_MSK)
#error "invalid DMA stream associated to SDADC3"
#endif



#if !defined(STM32_DMA_REQUIRED)
#define STM32_DMA_REQUIRED
#endif

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

/**
 * @brief   ADC sample data type.
 */
typedef uint16_t adcsample_t;

/**
 * @brief   Channels number in a conversion group.
 */
typedef uint16_t adc_channels_num_t;

/**
 * @brief   Possible ADC failure causes.
 * @note    Error codes are architecture dependent and should not relied
 *          upon.
 */
typedef enum {
  ADC_ERR_DMAFAILURE = 0,                   /**< DMA operations failure.    */
  ADC_ERR_OVERFLOW = 1                      /**< ADC overflow condition.    */
} adcerror_t;

/**
 * @brief   Type of a structure representing an ADC driver.
 */
typedef struct ADCDriver ADCDriver;

/**
 * @brief   ADC notification callback type.
 *
 * @param[in] adcp      pointer to the @p ADCDriver object triggering the
 *                      callback
 * @param[in] buffer    pointer to the most recent samples data
 * @param[in] n         number of buffer rows available starting from @p buffer
 */
typedef void (*adccallback_t)(ADCDriver *adcp, adcsample_t *buffer, size_t n);

/**
 * @brief   ADC error callback type.
 *
 * @param[in] adcp      pointer to the @p ADCDriver object triggering the
 *                      callback
 * @param[in] err       ADC error code
 */
typedef void (*adcerrorcallback_t)(ADCDriver *adcp, adcerror_t err);

/**
 * @brief   Conversion group configuration structure.
 * @details This implementation-dependent structure describes a conversion
 *          operation.
 * @note    The use of this configuration structure requires knowledge of
 *          STM32 ADC cell registers interface, please refer to the STM32
 *          reference manual for details.
 */
typedef struct {
  /**
   * @brief   Enables the circular buffer mode for the group.
   */
  bool_t                    circular;
  /**
   * @brief   Number of the analog channels belonging to the conversion group.
   */
  adc_channels_num_t        num_channels;
  /**
   * @brief   Callback function associated to the group or @p NULL.
   */
  adccallback_t             end_cb;
  /**
   * @brief   Error callback or @p NULL.
   */
  adcerrorcallback_t        error_cb;
  /* End of the mandatory fields.*/

  /**
   * @brief  Union of ADC and SDADC config parms.  The decision of which struct 
   *         union to use is determined by the ADCDriver.  If the ADCDriver adc parm
   *         is not NULL, then use the adc struct, otherwise if the ADCDriver sdadc parm
   *         is not NULL, then use the sdadc struct.
   */
  union { 
    struct {
      /**
       * @brief   ADC CR1 register initialization data.
       * @note    All the required bits must be defined into this field except
       *          @p ADC_CR1_SCAN that is enforced inside the driver.
       */
      uint32_t                  cr1;
      /**
       * @brief   ADC CR2 register initialization data.
       * @note    All the required bits must be defined into this field except
       *          @p ADC_CR2_DMA, @p ADC_CR2_CONT and @p ADC_CR2_ADON that are
       *          enforced inside the driver.
       */
      uint32_t                  cr2;
      /**
       * @brief   ADC SMPR1 register initialization data.
       * @details In this field must be specified the sample times for channels
       *          10...18.
       */
      uint32_t                  smpr1;
      /**
       * @brief   ADC SMPR2 register initialization data.
       * @details In this field must be specified the sample times for channels
       *          0...9.
       */
      uint32_t                  smpr2;
      /**
       * @brief   ADC SQR1 register initialization data.
       * @details Conversion group sequence 13...16 + sequence length.
       */
      uint32_t                  sqr1;
      /**
       * @brief   ADC SQR2 register initialization data.
       * @details Conversion group sequence 7...12.
       */
      uint32_t                  sqr2;
      /**
       * @brief   ADC SQR3 register initialization data.
       * @details Conversion group sequence 1...6.
       */
      uint32_t                  sqr3;
    } adc;
    struct {
      /**
       * @brief   SDADC CR1 register initialization data.
       * @note    All the required bits must be defined into this field
       */
      uint32_t                  cr1;
      /**
       * @brief   SDADC CR2 register initialization data.
       * @note    All the required bits must be defined into this field except
       *          @p ADC_CR2_DMA, @p ADC_CR2_CONT and @p ADC_CR2_ADON that are
       *          enforced inside the driver.
       */
      uint32_t                  cr2;
      /**
       * @brief   SDADC JCHGR register initialization data.
       * @details Bitfield indicating whether channel i is part of the injected group.
       *          0 <= i <= 8.  Highest channel, (8), is converted first
       */
      uint32_t                  jchgr;
      /**
       * @brief   SDADC CONF0R register initialization data.
       * @details In this field are the parameters for configuration 0
       */
      uint32_t                  conf0r;
      /**
       * @brief   SDADC CONF1R register initialization data.
       * @details In this field are the parameters for configuration 1
       */
      uint32_t                  conf1r;
      /**
       * @brief   SDADC CONF2R register initialization data.
       * @details In this field are the parameters for configuration 2
       */
      uint32_t                  conf2r;
      /**
       * @brief   SDADC CONFCH1R register initialization data.
       * @details In this field channels 0-7 are assigned to a configuration.
       */
      uint32_t                  confchr1;
      /**
       * @brief   SDADC CONFCH2R register initialization data.
       * @details In this field channel 8 is assigned to a configuration.
       * @details In this field are the parameters for configuration 2
       */
      uint32_t                  confchr2;

